<a href="https://colab.research.google.com/github/mdatta17/Work/blob/master/FeatureEngineering2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Logistic Regression with Feature Engineering**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
file_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Data-Science-Workshop/master/Chapter03/bank-full.csv'

In [ ]:
bankData=pd.read_csv(file_url,sep=';')

In [ ]:
from sklearn import preprocessing

**NORMALIZING DATA**

In [ ]:
x=bankData[['balance']].values.astype(float)

**SCALING**

In [ ]:
minmaxscaler=preprocessing.MinMaxScaler()

In [ ]:
bankData['balanceTran']=minmaxscaler.fit_transform(x)

In [ ]:
bankData.head()

   age           job  marital  education  ... previous  poutcome   y balanceTran
0   58    management  married   tertiary  ...        0   unknown  no    0.092259
1   44    technician   single  secondary  ...        0   unknown  no    0.073067
2   33  entrepreneur  married  secondary  ...        0   unknown  no    0.072822
3   47   blue-collar  married    unknown  ...        0   unknown  no    0.086476
4   33       unknown   single    unknown  ...        0   unknown  no    0.072812

[5 rows x 18 columns]

In [ ]:
bankData['balanceTran']=bankData['balanceTran']+0.00001

In [ ]:
bankData['loanTran']=1

In [ ]:
bankData.loc[bankData['loan']=='no','loanTran']=5

In [ ]:
del bankData['loantran']

In [ ]:
bankData.head()

   age           job  marital  education  ...   y  balanceTran houseTran loanTran
0   58    management  married   tertiary  ...  no     0.092269         5        5
1   44    technician   single  secondary  ...  no     0.073077         5        5
2   33  entrepreneur  married  secondary  ...  no     0.072832         5        1
3   47   blue-collar  married    unknown  ...  no     0.086486         5        5
4   33       unknown   single    unknown  ...  no     0.072822         1        5

[5 rows x 20 columns]

In [ ]:
bankData['houseTran']=5

In [ ]:
bankData.loc[bankData['housing']=='no','houseTran']=1

In [ ]:
bankData.head()

   age           job  marital  education  ...   y  balanceTran loantran houseTran
0   58    management  married   tertiary  ...  no     0.092269        5         5
1   44    technician   single  secondary  ...  no     0.073077        5         5
2   33  entrepreneur  married  secondary  ...  no     0.072832        1         5
3   47   blue-collar  married    unknown  ...  no     0.086486        5         5
4   33       unknown   single    unknown  ...  no     0.072822        5         1

[5 rows x 20 columns]

In [ ]:
bankData['assetIndex']=bankData['balanceTran']*bankData['loanTran']*bankData['houseTran']

In [ ]:
bankData.head()

   age           job  marital  ... houseTran loanTran  assetIndex
0   58    management  married  ...         5        5    2.306734
1   44    technician   single  ...         5        5    1.826916
2   33  entrepreneur  married  ...         5        1    0.364158
3   47   blue-collar  married  ...         5        5    2.162153
4   33       unknown   single  ...         1        5    0.364112

[5 rows x 21 columns]

In [ ]:
np.quantile(bankData['assetIndex'],[0.25,0.5,0.75])

array([0.37668646, 0.56920367, 1.9027249 ])

In [ ]:
bankData['assetClass']= 'Quant1'

In [ ]:
bankData.loc[(bankData['assetIndex']>0.38) & (bankData['assetIndex']<0.57),'assetClass']='Quant2'
bankData.loc[(bankData['assetIndex']>0.57) & (bankData['assetIndex']<1.9),'assetClass']='Quant3'
bankData.loc[bankData['assetIndex']>1.9,'assetClass']='Quant4'

In [ ]:
bankData.head()

   age           job  marital  ... loanTran assetIndex  assetClass
0   58    management  married  ...        5   2.306734      Quant4
1   44    technician   single  ...        5   1.826916      Quant3
2   33  entrepreneur  married  ...        1   0.364158      Quant1
3   47   blue-collar  married  ...        5   2.162153      Quant4
4   33       unknown   single  ...        5   0.364112      Quant1

[5 rows x 22 columns]

In [ ]:
assetTot=bankData.groupby(['assetClass'])['y'].agg(assettot='count').reset_index()

In [ ]:
assetTot.head()

  assetClass  assettot
0     Quant1     12212
1     Quant2     10400
2     Quant3     11121
3     Quant4     11478

In [ ]:
assetProp=bankData.groupby(['assetClass','y'])['y'].agg(assetCat='count').reset_index()

In [ ]:
assetProp

  assetClass    y  assetCat
0     Quant1   no     10921
1     Quant1  yes      1291
2     Quant2   no      8436
3     Quant2  yes      1964
4     Quant3   no     10144
5     Quant3  yes       977
6     Quant4   no     10421
7     Quant4  yes      1057

In [ ]:
assetcomb=pd.merge(assetTot,assetProp,on=['assetClass'])
assetcomb['catprop']=(assetcomb.assetCat/assetcomb.assettot)*100

In [ ]:
assetcomb

  assetClass  assettot    y  assetCat    catprop
0     Quant1     12212   no     10921  89.428431
1     Quant1     12212  yes      1291  10.571569
2     Quant2     10400   no      8436  81.115385
3     Quant2     10400  yes      1964  18.884615
4     Quant3     11121   no     10144  91.214819
5     Quant3     11121  yes       977   8.785181
6     Quant4     11478   no     10421  90.791079
7     Quant4     11478  yes      1057   9.208921

In [ ]:
from matplotlib import pyplot

In [ ]:
bankData.head()

   age           job  marital  ... loanTran assetIndex  assetClass
0   58    management  married  ...        5   2.306734      Quant4
1   44    technician   single  ...        5   1.826916      Quant3
2   33  entrepreneur  married  ...        1   0.364158      Quant1
3   47   blue-collar  married  ...        5   2.162153      Quant4
4   33       unknown   single  ...        5   0.364112      Quant1

[5 rows x 22 columns]

In [ ]:
bankData.dtypes

age              int64
job             object
marital         object
education       object
default         object
balance          int64
housing         object
loan            object
contact         object
day              int64
month           object
duration         int64
campaign         int64
pdays            int64
previous         int64
poutcome        object
y               object
balanceTran    float64
houseTran        int64
loanTran         int64
assetIndex     float64
assetClass      object
dtype: object

In [ ]:
bankCat=pd.get_dummies(bankData[['job','marital','education','default','contact','month','poutcome']])

In [ ]:
banknum=bankData[['age','day','duration','campaign','pdays','previous','assetIndex']]

In [ ]:
minmaxscaler=preprocessing.MinMaxScaler()

In [ ]:
ageT=banknum[['age']].values.astype(float)
dayT=banknum[['day']].values.astype(float)
durationT=banknum[['duration']].values.astype(float)

In [ ]:
banknum['ageTran']=minmaxscaler.fit_transform(ageT)
banknum['datTran']=minmaxscaler.fit_transform(dayT)
banknum['durationTran']=minmaxscaler.fit_transform(durationT)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [ ]:
banknum2=banknum[['ageTran','datTran','durationTran','assetIndex','previous','pdays','campaign']]

In [ ]:
X= pd.concat([banknum2,bankCat],axis=1)

In [ ]:
y = bankData['y']

In [ ]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.metrics import classification_report

In [ ]:
bankModel= LogisticRegression()

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.3, random_state=123)

In [ ]:
bankModel.fit(X_train,y_train)

/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
pred=bankModel.predict(X_test)

In [ ]:
bankModel.score(X_test,y_test)

0.8934680035387791

In [ ]:
from sklearn.metrics import confusion_matrix

In [ ]:
confusionm=confusion_matrix(y_test,pred)

In [ ]:
confusionm

array([[11760,   238],
       [ 1207,   359]])

In [ ]:
print(classification_report(y_test,pred))

              precision    recall  f1-score   support

          no       0.91      0.98      0.94     11998
         yes       0.60      0.23      0.33      1566

    accuracy                           0.89     13564
   macro avg       0.75      0.60      0.64     13564
weighted avg       0.87      0.89      0.87     13564